/**
  ******************************************************************************
  * @file    bsp_led.c
  * @author
  * @version V1.0
  * @date    2019-08-04
  * @brief   led应用函数接口
  ******************************************************************************
  */

#include "led.h"

void LED_Init(void)//led初始化函数
{
    P1DIR |= BIT0;   //设置P1.0口为输出模式
    P4DIR |= BIT1;   //设置p4.7口为输出模式

    //    P1OUT|=BIT0;     //高电平点灯
    //    P4OUT|=BIT7;     //高电平点灯
        P1OUT&=~BIT0;   //低电平熄灯
        P4OUT&=~BIT1;   //低电平熄灯
}
